      *--------------------------------------------------------------*  TCRP0001
      *                                                              *  TCRP0002
      *  Indicator table for RPGII programs converted to COBOL-85.   *  TCRP0003
      *                                                              *  TCRP0004
      *  Function key indicators are in the copy module RCINDFKY     *  TCRP0005
      *                                                              *  TCRP0006
      *--------------------------------------------------------------*  TCRP0007
               10  I-GENERAL.                                           TCRP0008
                   15  F-00                PICTURE 9.                   TCRP0009
                       88  I-00                VALUE 1.                 TCRP0010
                       88  NOT-I-00            VALUE 0.                 TCRP0011
                   15  F-01                PICTURE 9.                   TCRP0012
                       88  I-01                VALUE 1.                 TCRP0013
                       88  NOT-I-01            VALUE 0.                 TCRP0014
                   15  F-02                PICTURE 9.                   TCRP0015
                       88  I-02                VALUE 1.                 TCRP0016
                       88  NOT-I-02            VALUE 0.                 TCRP0017
                   15  F-03                PICTURE 9.                   TCRP0018
                       88  I-03                VALUE 1.                 TCRP0019
                       88  NOT-I-03            VALUE 0.                 TCRP0020
                   15  F-04                PICTURE 9.                   TCRP0021
                       88  I-04                VALUE 1.                 TCRP0022
                       88  NOT-I-04            VALUE 0.                 TCRP0023
                   15  F-05                PICTURE 9.                   TCRP0024
                       88  I-05                VALUE 1.                 TCRP0025
                       88  NOT-I-05            VALUE 0.                 TCRP0026
                   15  F-06                PICTURE 9.                   TCRP0027
                       88  I-06                VALUE 1.                 TCRP0028
                       88  NOT-I-06            VALUE 0.                 TCRP0029
                   15  F-07                PICTURE 9.                   TCRP0030
                       88  I-07                VALUE 1.                 TCRP0031
                       88  NOT-I-07            VALUE 0.                 TCRP0032
                   15  F-08                PICTURE 9.                   TCRP0033
                       88  I-08                VALUE 1.                 TCRP0034
                       88  NOT-I-08            VALUE 0.                 TCRP0035
                   15  F-09                PICTURE 9.                   TCRP0036
                       88  I-09                VALUE 1.                 TCRP0037
                       88  NOT-I-09            VALUE 0.                 TCRP0038
                   15  F-10                PICTURE 9.                   TCRP0039
                       88  I-10                VALUE 1.                 TCRP0040
                       88  NOT-I-10            VALUE 0.                 TCRP0041
                   15  F-11                PICTURE 9.                   TCRP0042
                       88  I-11                VALUE 1.                 TCRP0043
                       88  NOT-I-11            VALUE 0.                 TCRP0044
                   15  F-12                PICTURE 9.                   TCRP0045
                       88  I-12                VALUE 1.                 TCRP0046
                       88  NOT-I-12            VALUE 0.                 TCRP0047
                   15  F-13                PICTURE 9.                   TCRP0048
                       88  I-13                VALUE 1.                 TCRP0049
                       88  NOT-I-13            VALUE 0.                 TCRP0050
                   15  F-14                PICTURE 9.                   TCRP0051
                       88  I-14                VALUE 1.                 TCRP0052
                       88  NOT-I-14            VALUE 0.                 TCRP0053
                   15  F-15                PICTURE 9.                   TCRP0054
                       88  I-15                VALUE 1.                 TCRP0055
                       88  NOT-I-15            VALUE 0.                 TCRP0056
                   15  F-16                PICTURE 9.                   TCRP0057
                       88  I-16                VALUE 1.                 TCRP0058
                       88  NOT-I-16            VALUE 0.                 TCRP0059
                   15  F-17                PICTURE 9.                   TCRP0060
                       88  I-17                VALUE 1.                 TCRP0061
                       88  NOT-I-17            VALUE 0.                 TCRP0062
                   15  F-18                PICTURE 9.                   TCRP0063
                       88  I-18                VALUE 1.                 TCRP0064
                       88  NOT-I-18            VALUE 0.                 TCRP0065
                   15  F-19                PICTURE 9.                   TCRP0066
                       88  I-19                VALUE 1.                 TCRP0067
                       88  NOT-I-19            VALUE 0.                 TCRP0068
                   15  F-20                PICTURE 9.                   TCRP0069
                       88  I-20                VALUE 1.                 TCRP0070
                       88  NOT-I-20            VALUE 0.                 TCRP0071
                   15  F-21                PICTURE 9.                   TCRP0072
                       88  I-21                VALUE 1.                 TCRP0073
                       88  NOT-I-21            VALUE 0.                 TCRP0074
                   15  F-22                PICTURE 9.                   TCRP0075
                       88  I-22                VALUE 1.                 TCRP0076
                       88  NOT-I-22            VALUE 0.                 TCRP0077
                   15  F-23                PICTURE 9.                   TCRP0078
                       88  I-23                VALUE 1.                 TCRP0079
                       88  NOT-I-23            VALUE 0.                 TCRP0080
                   15  F-24                PICTURE 9.                   TCRP0081
                       88  I-24                VALUE 1.                 TCRP0082
                       88  NOT-I-24            VALUE 0.                 TCRP0083
                   15  F-25                PICTURE 9.                   TCRP0084
                       88  I-25                VALUE 1.                 TCRP0085
                       88  NOT-I-25            VALUE 0.                 TCRP0086
                   15  F-26                PICTURE 9.                   TCRP0087
                       88  I-26                VALUE 1.                 TCRP0088
                       88  NOT-I-26            VALUE 0.                 TCRP0089
                   15  F-27                PICTURE 9.                   TCRP0090
                       88  I-27                VALUE 1.                 TCRP0091
                       88  NOT-I-27            VALUE 0.                 TCRP0092
                   15  F-28                PICTURE 9.                   TCRP0093
                       88  I-28                VALUE 1.                 TCRP0094
                       88  NOT-I-28            VALUE 0.                 TCRP0095
                   15  F-29                PICTURE 9.                   TCRP0096
                       88  I-29                VALUE 1.                 TCRP0097
                       88  NOT-I-29            VALUE 0.                 TCRP0098
                   15  F-30                PICTURE 9.                   TCRP0099
                       88  I-30                VALUE 1.                 TCRP0100
                       88  NOT-I-30            VALUE 0.                 TCRP0101
                   15  F-31                PICTURE 9.                   TCRP0102
                       88  I-31                VALUE 1.                 TCRP0103
                       88  NOT-I-31            VALUE 0.                 TCRP0104
                   15  F-32                PICTURE 9.                   TCRP0105
                       88  I-32                VALUE 1.                 TCRP0106
                       88  NOT-I-32            VALUE 0.                 TCRP0107
                   15  F-33                PICTURE 9.                   TCRP0108
                       88  I-33                VALUE 1.                 TCRP0109
                       88  NOT-I-33            VALUE 0.                 TCRP0110
                   15  F-34                PICTURE 9.                   TCRP0111
                       88  I-34                VALUE 1.                 TCRP0112
                       88  NOT-I-34            VALUE 0.                 TCRP0113
                   15  F-35                PICTURE 9.                   TCRP0114
                       88  I-35                VALUE 1.                 TCRP0115
                       88  NOT-I-35            VALUE 0.                 TCRP0116
                   15  F-36                PICTURE 9.                   TCRP0117
                       88  I-36                VALUE 1.                 TCRP0118
                       88  NOT-I-36            VALUE 0.                 TCRP0119
                   15  F-37                PICTURE 9.                   TCRP0120
                       88  I-37                VALUE 1.                 TCRP0121
                       88  NOT-I-37            VALUE 0.                 TCRP0122
                   15  F-38                PICTURE 9.                   TCRP0123
                       88  I-38                VALUE 1.                 TCRP0124
                       88  NOT-I-38            VALUE 0.                 TCRP0125
                   15  F-39                PICTURE 9.                   TCRP0126
                       88  I-39                VALUE 1.                 TCRP0127
                       88  NOT-I-39            VALUE 0.                 TCRP0128
                   15  F-40                PICTURE 9.                   TCRP0129
                       88  I-40                VALUE 1.                 TCRP0130
                       88  NOT-I-40            VALUE 0.                 TCRP0131
                   15  F-41                PICTURE 9.                   TCRP0132
                       88  I-41                VALUE 1.                 TCRP0133
                       88  NOT-I-41            VALUE 0.                 TCRP0134
                   15  F-42                PICTURE 9.                   TCRP0135
                       88  I-42                VALUE 1.                 TCRP0136
                       88  NOT-I-42            VALUE 0.                 TCRP0137
                   15  F-43                PICTURE 9.                   TCRP0138
                       88  I-43                VALUE 1.                 TCRP0139
                       88  NOT-I-43            VALUE 0.                 TCRP0140
                   15  F-44                PICTURE 9.                   TCRP0141
                       88  I-44                VALUE 1.                 TCRP0142
                       88  NOT-I-44            VALUE 0.                 TCRP0143
                   15  F-45                PICTURE 9.                   TCRP0144
                       88  I-45                VALUE 1.                 TCRP0145
                       88  NOT-I-45            VALUE 0.                 TCRP0146
                   15  F-46                PICTURE 9.                   TCRP0147
                       88  I-46                VALUE 1.                 TCRP0148
                       88  NOT-I-46            VALUE 0.                 TCRP0149
                   15  F-47                PICTURE 9.                   TCRP0150
                       88  I-47                VALUE 1.                 TCRP0151
                       88  NOT-I-47            VALUE 0.                 TCRP0152
                   15  F-48                PICTURE 9.                   TCRP0153
                       88  I-48                VALUE 1.                 TCRP0154
                       88  NOT-I-48            VALUE 0.                 TCRP0155
                   15  F-49                PICTURE 9.                   TCRP0156
                       88  I-49                VALUE 1.                 TCRP0157
                       88  NOT-I-49            VALUE 0.                 TCRP0158
                   15  F-50                PICTURE 9.                   TCRP0159
                       88  I-50                VALUE 1.                 TCRP0160
                       88  NOT-I-50            VALUE 0.                 TCRP0161
                   15  F-51                PICTURE 9.                   TCRP0162
                       88  I-51                VALUE 1.                 TCRP0163
                       88  NOT-I-51            VALUE 0.                 TCRP0164
                   15  F-52                PICTURE 9.                   TCRP0165
                       88  I-52                VALUE 1.                 TCRP0166
                       88  NOT-I-52            VALUE 0.                 TCRP0167
                   15  F-53                PICTURE 9.                   TCRP0168
                       88  I-53                VALUE 1.                 TCRP0169
                       88  NOT-I-53            VALUE 0.                 TCRP0170
                   15  F-54                PICTURE 9.                   TCRP0171
                       88  I-54                VALUE 1.                 TCRP0172
                       88  NOT-I-54            VALUE 0.                 TCRP0173
                   15  F-55                PICTURE 9.                   TCRP0174
                       88  I-55                VALUE 1.                 TCRP0175
                       88  NOT-I-55            VALUE 0.                 TCRP0176
                   15  F-56                PICTURE 9.                   TCRP0177
                       88  I-56                VALUE 1.                 TCRP0178
                       88  NOT-I-56            VALUE 0.                 TCRP0179
                   15  F-57                PICTURE 9.                   TCRP0180
                       88  I-57                VALUE 1.                 TCRP0181
                       88  NOT-I-57            VALUE 0.                 TCRP0182
                   15  F-58                PICTURE 9.                   TCRP0183
                       88  I-58                VALUE 1.                 TCRP0184
                       88  NOT-I-58            VALUE 0.                 TCRP0185
                   15  F-59                PICTURE 9.                   TCRP0186
                       88  I-59                VALUE 1.                 TCRP0187
                       88  NOT-I-59            VALUE 0.                 TCRP0188
                   15  F-60                PICTURE 9.                   TCRP0189
                       88  I-60                VALUE 1.                 TCRP0190
                       88  NOT-I-60            VALUE 0.                 TCRP0191
                   15  F-61                PICTURE 9.                   TCRP0192
                       88  I-61                VALUE 1.                 TCRP0193
                       88  NOT-I-61            VALUE 0.                 TCRP0194
                   15  F-62                PICTURE 9.                   TCRP0195
                       88  I-62                VALUE 1.                 TCRP0196
                       88  NOT-I-62            VALUE 0.                 TCRP0197
                   15  F-63                PICTURE 9.                   TCRP0198
                       88  I-63                VALUE 1.                 TCRP0199
                       88  NOT-I-63            VALUE 0.                 TCRP0200
                   15  F-64                PICTURE 9.                   TCRP0201
                       88  I-64                VALUE 1.                 TCRP0202
                       88  NOT-I-64            VALUE 0.                 TCRP0203
                   15  F-65                PICTURE 9.                   TCRP0204
                       88  I-65                VALUE 1.                 TCRP0205
                       88  NOT-I-65            VALUE 0.                 TCRP0206
                   15  F-66                PICTURE 9.                   TCRP0207
                       88  I-66                VALUE 1.                 TCRP0208
                       88  NOT-I-66            VALUE 0.                 TCRP0209
                   15  F-67                PICTURE 9.                   TCRP0210
                       88  I-67                VALUE 1.                 TCRP0211
                       88  NOT-I-67            VALUE 0.                 TCRP0212
                   15  F-68                PICTURE 9.                   TCRP0213
                       88  I-68                VALUE 1.                 TCRP0214
                       88  NOT-I-68            VALUE 0.                 TCRP0215
                   15  F-69                PICTURE 9.                   TCRP0216
                       88  I-69                VALUE 1.                 TCRP0217
                       88  NOT-I-69            VALUE 0.                 TCRP0218
                   15  F-70                PICTURE 9.                   TCRP0219
                       88  I-70                VALUE 1.                 TCRP0220
                       88  NOT-I-70            VALUE 0.                 TCRP0221
                   15  F-71                PICTURE 9.                   TCRP0222
                       88  I-71                VALUE 1.                 TCRP0223
                       88  NOT-I-71            VALUE 0.                 TCRP0224
                   15  F-72                PICTURE 9.                   TCRP0225
                       88  I-72                VALUE 1.                 TCRP0226
                       88  NOT-I-72            VALUE 0.                 TCRP0227
                   15  F-73                PICTURE 9.                   TCRP0228
                       88  I-73                VALUE 1.                 TCRP0229
                       88  NOT-I-73            VALUE 0.                 TCRP0230
                   15  F-74                PICTURE 9.                   TCRP0231
                       88  I-74                VALUE 1.                 TCRP0232
                       88  NOT-I-74            VALUE 0.                 TCRP0233
                   15  F-75                PICTURE 9.                   TCRP0234
                       88  I-75                VALUE 1.                 TCRP0235
                       88  NOT-I-75            VALUE 0.                 TCRP0236
                   15  F-76                PICTURE 9.                   TCRP0237
                       88  I-76                VALUE 1.                 TCRP0238
                       88  NOT-I-76            VALUE 0.                 TCRP0239
                   15  F-77                PICTURE 9.                   TCRP0240
                       88  I-77                VALUE 1.                 TCRP0241
                       88  NOT-I-77            VALUE 0.                 TCRP0242
                   15  F-78                PICTURE 9.                   TCRP0243
                       88  I-78                VALUE 1.                 TCRP0244
                       88  NOT-I-78            VALUE 0.                 TCRP0245
                   15  F-79                PICTURE 9.                   TCRP0246
                       88  I-79                VALUE 1.                 TCRP0247
                       88  NOT-I-79            VALUE 0.                 TCRP0248
                   15  F-80                PICTURE 9.                   TCRP0249
                       88  I-80                VALUE 1.                 TCRP0250
                       88  NOT-I-80            VALUE 0.                 TCRP0251
                   15  F-81                PICTURE 9.                   TCRP0252
                       88  I-81                VALUE 1.                 TCRP0253
                       88  NOT-I-81            VALUE 0.                 TCRP0254
                   15  F-82                PICTURE 9.                   TCRP0255
                       88  I-82                VALUE 1.                 TCRP0256
                       88  NOT-I-82            VALUE 0.                 TCRP0257
                   15  F-83                PICTURE 9.                   TCRP0258
                       88  I-83                VALUE 1.                 TCRP0259
                       88  NOT-I-83            VALUE 0.                 TCRP0260
                   15  F-84                PICTURE 9.                   TCRP0261
                       88  I-84                VALUE 1.                 TCRP0262
                       88  NOT-I-84            VALUE 0.                 TCRP0263
                   15  F-85                PICTURE 9.                   TCRP0264
                       88  I-85                VALUE 1.                 TCRP0265
                       88  NOT-I-85            VALUE 0.                 TCRP0266
                   15  F-86                PICTURE 9.                   TCRP0267
                       88  I-86                VALUE 1.                 TCRP0268
                       88  NOT-I-86            VALUE 0.                 TCRP0269
                   15  F-87                PICTURE 9.                   TCRP0270
                       88  I-87                VALUE 1.                 TCRP0271
                       88  NOT-I-87            VALUE 0.                 TCRP0272
                   15  F-88                PICTURE 9.                   TCRP0273
                       88  I-88                VALUE 1.                 TCRP0274
                       88  NOT-I-88            VALUE 0.                 TCRP0275
                   15  F-89                PICTURE 9.                   TCRP0276
                       88  I-89                VALUE 1.                 TCRP0277
                       88  NOT-I-89            VALUE 0.                 TCRP0278
                   15  F-90                PICTURE 9.                   TCRP0279
                       88  I-90                VALUE 1.                 TCRP0280
                       88  NOT-I-90            VALUE 0.                 TCRP0281
                   15  F-91                PICTURE 9.                   TCRP0282
                       88  I-91                VALUE 1.                 TCRP0283
                       88  NOT-I-91            VALUE 0.                 TCRP0284
                   15  F-92                PICTURE 9.                   TCRP0285
                       88  I-92                VALUE 1.                 TCRP0286
                       88  NOT-I-92            VALUE 0.                 TCRP0287
                   15  F-93                PICTURE 9.                   TCRP0288
                       88  I-93                VALUE 1.                 TCRP0289
                       88  NOT-I-93            VALUE 0.                 TCRP0290
                   15  F-94                PICTURE 9.                   TCRP0291
                       88  I-94                VALUE 1.                 TCRP0292
                       88  NOT-I-94            VALUE 0.                 TCRP0293
                   15  F-95                PICTURE 9.                   TCRP0294
                       88  I-95                VALUE 1.                 TCRP0295
                       88  NOT-I-95            VALUE 0.                 TCRP0296
                   15  F-96                PICTURE 9.                   TCRP0297
                       88  I-96                VALUE 1.                 TCRP0298
                       88  NOT-I-96            VALUE 0.                 TCRP0299
                   15  F-97                PICTURE 9.                   TCRP0300
                       88  I-97                VALUE 1.                 TCRP0301
                       88  NOT-I-97            VALUE 0.                 TCRP0302
                   15  F-98                PICTURE 9.                   TCRP0303
                       88  I-98                VALUE 1.                 TCRP0304
                       88  NOT-I-98            VALUE 0.                 TCRP0305
                   15  F-99                PICTURE 9.                   TCRP0306
                       88  I-99                VALUE 1.                 TCRP0307
                       88  NOT-I-99            VALUE 0.                 TCRP0308
                   15  F-A1                PICTURE 9.                   TCRP0309
                       88  I-A1                VALUE 1.                 TCRP0310
                       88  NOT-I-A1            VALUE 0.                 TCRP0311
               10  I-HALT.                                              TCRP0312
                   15  F-H0                PICTURE 9.                   TCRP0313
                       88  I-H0                VALUE 1.                 TCRP0314
                       88  NOT-I-H0            VALUE 0.                 TCRP0315
                   15  F-H1                PICTURE 9.                   TCRP0316
                       88  I-H1                VALUE 1.                 TCRP0317
                       88  NOT-I-H1            VALUE 0.                 TCRP0318
                   15  F-H2                PICTURE 9.                   TCRP0319
                       88  I-H2                VALUE 1.                 TCRP0320
                       88  NOT-I-H2            VALUE 0.                 TCRP0321
                   15  F-H3                PICTURE 9.                   TCRP0322
                       88  I-H3                VALUE 1.                 TCRP0323
                       88  NOT-I-H3            VALUE 0.                 TCRP0324
                   15  F-H4                PICTURE 9.                   TCRP0325
                       88  I-H4                VALUE 1.                 TCRP0326
                       88  NOT-I-H4            VALUE 0.                 TCRP0327
                   15  F-H5                PICTURE 9.                   TCRP0328
                       88  I-H5                VALUE 1.                 TCRP0329
                       88  NOT-I-H5            VALUE 0.                 TCRP0330
                   15  F-H6                PICTURE 9.                   TCRP0331
                       88  I-H6                VALUE 1.                 TCRP0332
                       88  NOT-I-H6            VALUE 0.                 TCRP0333
                   15  F-H7                PICTURE 9.                   TCRP0334
                       88  I-H7                VALUE 1.                 TCRP0335
                       88  NOT-I-H7            VALUE 0.                 TCRP0336
                   15  F-H8                PICTURE 9.                   TCRP0337
                       88  I-H8                VALUE 1.                 TCRP0338
                       88  NOT-I-H8            VALUE 0.                 TCRP0339
                   15  F-H9                PICTURE 9.                   TCRP0340
                       88  I-H9                VALUE 1.                 TCRP0341
                       88  NOT-I-H9            VALUE 0.                 TCRP0342
               10  I-LEVEL.                                             TCRP0343
      *                                                                 TCRP0344
      *    I-L0  is always on  - IT MUST NEVER BE SET ON OR OFF         TCRP0345
      *                                                                 TCRP0346
                   15  F-L0                PICTURE 9.                   TCRP0347
                       88  I-L0                VALUE 1.                 TCRP0348
                   15  F-L1                PICTURE 9.                   TCRP0349
                       88  I-L1                VALUE 1.                 TCRP0350
                       88  NOT-I-L1            VALUE 0.                 TCRP0351
                   15  F-L2                PICTURE 9.                   TCRP0352
                       88  I-L2                VALUE 1.                 TCRP0353
                       88  NOT-I-L2            VALUE 0.                 TCRP0354
                   15  F-L3                PICTURE 9.                   TCRP0355
                       88  I-L3                VALUE 1.                 TCRP0356
                       88  NOT-I-L3            VALUE 0.                 TCRP0357
                   15  F-L4                PICTURE 9.                   TCRP0358
                       88  I-L4                VALUE 1.                 TCRP0359
                       88  NOT-I-L4            VALUE 0.                 TCRP0360
                   15  F-L5                PICTURE 9.                   TCRP0361
                       88  I-L5                VALUE 1.                 TCRP0362
                       88  NOT-I-L5            VALUE 0.                 TCRP0363
                   15  F-L6                PICTURE 9.                   TCRP0364
                       88  I-L6                VALUE 1.                 TCRP0365
                       88  NOT-I-L6            VALUE 0.                 TCRP0366
                   15  F-L7                PICTURE 9.                   TCRP0367
                       88  I-L7                VALUE 1.                 TCRP0368
                       88  NOT-I-L7            VALUE 0.                 TCRP0369
                   15  F-L8                PICTURE 9.                   TCRP0370
                       88  I-L8                VALUE 1.                 TCRP0371
                       88  NOT-I-L8            VALUE 0.                 TCRP0372
                   15  F-L9                PICTURE 9.                   TCRP0373
                       88  I-L9                VALUE 1.                 TCRP0374
                       88  NOT-I-L9            VALUE 0.                 TCRP0375
               10  I-MATCH.                                             TCRP0376
                   15  F-M0                PICTURE 9.                   TCRP0377
                       88  I-M0                VALUE 1.                 TCRP0378
                       88  NOT-I-M0            VALUE 0.                 TCRP0379
                   15  F-M1                PICTURE 9.                   TCRP0380
                       88  I-M1                VALUE 1.                 TCRP0381
                       88  NOT-I-M1            VALUE 0.                 TCRP0382
                   15  F-M2                PICTURE 9.                   TCRP0383
                       88  I-M2                VALUE 1.                 TCRP0384
                       88  NOT-I-M2            VALUE 0.                 TCRP0385
                   15  F-M3                PICTURE 9.                   TCRP0386
                       88  I-M3                VALUE 1.                 TCRP0387
                       88  NOT-I-M3            VALUE 0.                 TCRP0388
                   15  F-M4                PICTURE 9.                   TCRP0389
                       88  I-M4                VALUE 1.                 TCRP0390
                       88  NOT-I-M4            VALUE 0.                 TCRP0391
                   15  F-M5                PICTURE 9.                   TCRP0392
                       88  I-M5                VALUE 1.                 TCRP0393
                       88  NOT-I-M5            VALUE 0.                 TCRP0394
                   15  F-M6                PICTURE 9.                   TCRP0395
                       88  I-M6                VALUE 1.                 TCRP0396
                       88  NOT-I-M6            VALUE 0.                 TCRP0397
                   15  F-M7                PICTURE 9.                   TCRP0398
                       88  I-M7                VALUE 1.                 TCRP0399
                       88  NOT-I-M7            VALUE 0.                 TCRP0400
                   15  F-M8                PICTURE 9.                   TCRP0401
                       88  I-M8                VALUE 1.                 TCRP0402
                       88  NOT-I-M8            VALUE 0.                 TCRP0403
                   15  F-M9                PICTURE 9.                   TCRP0404
                       88  I-M9                VALUE 1.                 TCRP0405
                       88  NOT-I-M9            VALUE 0.                 TCRP0406
               10  I-UPSI.                                              TCRP0407
                   15  F-U1                PICTURE 9.                   TCRP0408
                       88  I-U1                VALUE 1.                 TCRP0409
                       88  NOT-I-U1            VALUE 0.                 TCRP0410
                   15  F-U2                PICTURE 9.                   TCRP0411
                       88  I-U2                VALUE 1.                 TCRP0412
                       88  NOT-I-U2            VALUE 0.                 TCRP0413
                   15  F-U3                PICTURE 9.                   TCRP0414
                       88  I-U3                VALUE 1.                 TCRP0415
                       88  NOT-I-U3            VALUE 0.                 TCRP0416
                   15  F-U4                PICTURE 9.                   TCRP0417
                       88  I-U4                VALUE 1.                 TCRP0418
                       88  NOT-I-U4            VALUE 0.                 TCRP0419
                   15  F-U5                PICTURE 9.                   TCRP0420
                       88  I-U5                VALUE 1.                 TCRP0421
                       88  NOT-I-U5            VALUE 0.                 TCRP0422
                   15  F-U6                PICTURE 9.                   TCRP0423
                       88  I-U6                VALUE 1.                 TCRP0424
                       88  NOT-I-U6            VALUE 0.                 TCRP0425
                   15  F-U7                PICTURE 9.                   TCRP0426
                       88  I-U7                VALUE 1.                 TCRP0427
                       88  NOT-I-U7            VALUE 0.                 TCRP0428
                   15  F-U8                PICTURE 9.                   TCRP0429
                       88  I-U8                VALUE 1.                 TCRP0430
                       88  NOT-I-U8            VALUE 0.                 TCRP0431
               10  I-SPECIAL.                                           TCRP0432
                   15  F-LR                PICTURE 9.                   TCRP0433
                       88  I-LR                VALUE 1.                 TCRP0434
                       88  NOT-I-LR            VALUE 0.                 TCRP0435
                   15  F-MR                PICTURE 9.                   TCRP0436
                       88  I-MR                VALUE 1.                 TCRP0437
                       88  NOT-I-MR            VALUE 0.                 TCRP0438
                   15  F-LB                PICTURE 9.                   TCRP0439
                       88  I-LB                VALUE 1.                 TCRP0440
                       88  NOT-I-LB            VALUE 0.                 TCRP0441
                   15  F-1ST               PICTURE 9.                   TCRP0442
                       88  I-1ST               VALUE 1.                 TCRP0443
                       88  NOT-I-1ST           VALUE 0.                 TCRP0444
                   15  F-1P                PICTURE 9.                   TCRP0445
                       88  I-1P                VALUE 1.                 TCRP0446
                       88  NOT-I-1P            VALUE 0.                 TCRP0447
               10  I-OVERFLOW.                                          TCRP0448
                   15  F-OA                PICTURE 9.                   TCRP0449
                       88  I-OA                VALUE 1.                 TCRP0450
                       88  NOT-I-OA            VALUE 0.                 TCRP0451
                   15  F-OB                PICTURE 9.                   TCRP0452
                       88  I-OB                VALUE 1.                 TCRP0453
                       88  NOT-I-OB            VALUE 0.                 TCRP0454
                   15  F-OC                PICTURE 9.                   TCRP0455
                       88  I-OC                VALUE 1.                 TCRP0456
                       88  NOT-I-OC            VALUE 0.                 TCRP0457
                   15  F-OD                PICTURE 9.                   TCRP0458
                       88  I-OD                VALUE 1.                 TCRP0459
                       88  NOT-I-OD            VALUE 0.                 TCRP0460
                   15  F-OE                PICTURE 9.                   TCRP0461
                       88  I-OE                VALUE 1.                 TCRP0462
                       88  NOT-I-OE            VALUE 0.                 TCRP0463
                   15  F-OF                PICTURE 9.                   TCRP0464
                       88  I-OF                VALUE 1.                 TCRP0465
                       88  NOT-I-OF            VALUE 0.                 TCRP0466
                   15  F-OG                PICTURE 9.                   TCRP0467
                       88  I-OG                VALUE 1.                 TCRP0468
                       88  NOT-I-OG            VALUE 0.                 TCRP0469
                   15  F-OV                PICTURE 9.                   TCRP0470
                       88  I-OV                VALUE 1.                 TCRP0471
                       88  NOT-I-OV            VALUE 0.                 TCRP0472
